//логическая операция или ||

#include <iostream>

int main(){
	using namespace std;
	cout << "Эта программа может отформатирвоть ваш жесткий диск\n"
			"И уничтожить все данные.\n"
			"Хотите продолжить ? <y/n> ";
	char ch;
	cin >> ch;
	if (ch == 'y' || ch == 'Y')
		cout << "Вас предупредили! \a\n";
	else if (ch == 'n' || ch == 'N')
		cout << "Мудрый выбор! ... прощайте!\n";
	else
		cout << "Это ни да ни нет, поэтому, предполагаю, что "
				"нужно очистить диск в любом случае" << endl;
	return 0;
}

