//считает по особому налог с доходов

#include <iostream>

int main(){
	using namespace std;

	const double Grade = 5000;

	double value;

	cout << "Введите вашу сумму дохода: ";
	cin >> value;

	while (value > 0){
		double tax = 0;

		if (value >= Grade){
			value -= Grade;
			tax += Grade * 0.00;
		}
		else {
			cout << "У вас нет налогов\n";

			cout << "Введите сумму дохода: ";
			cin >> value;

			continue;
		}

		if (value >= (2 * Grade)){
			value -= (2 * Grade);
			tax += (2 * Grade) * 0.10;
		}
		else {
			tax += value * 0.10;
			cout << "Ваш налог: " <<  tax << endl;

			cout << "Введите сумму дохода: ";
			cin >> value;

			continue;
		}

		if (value >= (4 * Grade)){
			value -= (4 * Grade);
			tax += (4 * Grade) * 0.15;
		}
		else {
			tax += value * 0.15;
			cout << "Ваш налог: " << tax << endl;

			cout << "Введите сумму дохода: ";
			cin >> value;

			continue;
		}

		tax += value * 0.20;
		cout << "Ваш налог: " << tax << endl;
		
		cout << "Введите сумму дохода: ";
		cin >> value;
	}
	return 0;
}
/*

Псевдокод

1. Ввожу значение.

2. Значение - число и больше нуля?

3. Если нет - прерываем программу;

4. Если да:
	1. значение больше 5000 ?
	если да - вычитаем 5000, записываем налог для суммы 5000.
	если нет - налога нету;

	2. оставшееся значение больше 10 000 ?
	если да - вычитаем 10 000, записываем уже имеющийся налог + налог для суммы 10000.
	если нет - считаем налог по ставке для этой оставшейся суммы, прибавляем к имеющемуся.

	3. оставшееся значение больше 20 000 ?
	если да - вычитаем 20 000, записываем уже имеющийся налог + налог для суммы 20000.
	если нет - считаем налог по ставке для этой оставшейся суммы, прибавляем к имеющемуся.

	4. считаем налог для оставшейся суммы свыше 35 + уже имеющаяся сумма налога

5. Выводим результат.
*/

